createPatch/testCase/system/createPatchDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  dev
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
 
    {
        name                test_inlet;
        patchInfo
        {
            type            patch;
            // type            cyclic;
            // neighbourPatch  interface_block2_east;
            // transform       coincidentFullMatch;
        }
        constructFrom patches;
        patches (inlet);
    }

    {
        name                test_outlet;
        patchInfo
        {
            type            patch;
            // type            cyclic;
            // neighbourPatch  interface_block1_east;
            // transform       coincidentFullMatch;
        }
        constructFrom patches;
        patches (outlet);
    }
    
);


// ************************************************************************* //
    